js_practice/app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 1) LIMIT 1
---
  def show
    #debugger
    cat_id = params[:id]
    @category = Category.find(cat_id)

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 1) LIMIT 1
---
  def edit
    @cat_id = params[:id]
    @category = Category.find(params[:id]);

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 1) LIMIT 1
UPDATE `categories` SET `name` = 'Garments88', `updated_at` = '2011-03-31 11:55:15' WHERE (`categories`.`id` = 1)
---
  def update
    @category = Category.find(params[:id])
    @category.update_attributes(params[:category])

SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 1) LIMIT 1
DELETE FROM `categories` WHERE (`categories`.`id` = 1)
---
  def destroy
    debugger
    @category = Category.find(params[:id])
    @category.destroy